rackStorage/0/alphaSgs
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          alphaSgs;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    outlet      
    {
        type            zeroGradient;
    }
    ground           
    {
        type            zeroGradient;
    }
    side
    {
        type            zeroGradient;
    }
    burner          
    {
        type            zeroGradient;
    }
    "region0_to_panelRegion_panel.*"
    {
        type        alphaSgsFireWallFunction; 
        QcFlame     18000;
        QcThreshold 1000;
        value       uniform 0;
    }
}

// ************************************************************************* //
