rackStorage/0/panelRegion/Qr
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Qr;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    ".*"
    {
        type            zeroGradient;
    }

    region0_to_panelRegion_panel
    {
        type            mappedField;
        sampleRegion    region0;
        sampleMode      nearestPatchFace;
        samplePatch     region0_to_panelRegion_panel;
        offset          (0 0 0);
        fieldName       Qr;
        setAverage      no;
        average         0;
        value           uniform 0;
    }
}

// ************************************************************************* //
