rackStorage/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    ground
    {
        type            wall;
        nFaces          7024;
        startFace       1543420;
    }
    side
    {
        type            patch;
        nFaces          3368;
        startFace       1550444;
    }
    outlet
    {
        type            patch;
        nFaces          196;
        startFace       1553812;
    }
    burner
    {
        type            patch;
        nFaces          32;
        startFace       1554008;
    }
    region0_to_panelRegion_panel
    {
        type            mappedWall;
        nFaces          56416;
        startFace       1554040;
        sampleMode      nearestPatchFace;
        sampleRegion    panelRegion;
        samplePatch     region0_to_panelRegion_panel;
        offsetMode      nonuniform;
        offsets         nonuniform List<vector> 
56416
(
(0 -2.22044604925e-16 0)
(1.11022302463e-16 -2.22044604925e-16 0)
(-5.55111512313e-17 2.22044604925e-16 -1.11022302463e-16)
(0 0 1.11022302463e-16)
(2.22044604925e-16 0 1.11022302463e-16)
(5.55111512313e-17 2.22044604925e-16 1.11022302463e-16)
(0 0 5.55111512313e-17)
(1.11022302463e-16 0 5.55111512313e-17)
...
)
;
    }
)

// ************************************************************************* //
